{
  "name": "Bernard Xie",
  "contact": {
    "phone": "(213) 268-4742",
    "email": "bxie94@gmail.com",
    "linkedin": "http://www.linkedin.com/in/xiebernard",
    "x": "https://x.com/berniex_x"
  },
  "summary": "Full-stack engineer with 9 years of experience, including 2 founding engineer roles. Currently building AI-native products as Founding CTO at a YC-backed startup. Track record of shipping complex systems end-to-end, from architecture to deployment, while mentoring teams and driving technical strategy.",
  "sections": [
    {
      "id": "work-experience",
      "title": "Work Experience",
      "jobs": [
        {
          "company": "Kestral",
          "ycBatch": "X25",
          "ycSlug": "kestral",
          "title": "Co-Founder & CTO",
          "period": "April 2025 – Present",
          "summary": "Kestral aims to accelerate your entire product developement lifecycle with SOTA AI Agents.",
          "details": [
            "Architected and built 90%+ of a production AI task management platform generating $X,000 MRR, owning the full stack from database schema design through React UI to GCP deployment pipelines and 30+ AI agents.",
            "Delivered a scalable multi-tenant SaaS platform by architecting a full-stack TypeScript system using React/Vite, Node/Express, Apollo GraphQL, and PostgreSQL, deployed on Google Cloud Run with optimized CI/CD for rapid iteration.",
            "Engineered a citation-grounded multi-agent AI system using Mastra orchestration and cloud agents—featuring an intelligent query router, 11 agentic tools, hybrid vector search, Zep graph memory, and multi-step workflows for task deduplication, prioritization, and project auto-categorization",
            "Designed distributed batch processing with Cloud Run Jobs, Cloud Tasks priority queues, and database-driven stream processing for sequential job execution—supporting real-time updates via GraphQL subscriptions, Redis Pub/Sub, and WebSockets, with 8+ external integrations",
            "Drove product identity and developer credibility through brand/visual design, marketing site development, founding engineer mentorship, top 0.01% Cursor power-user recognition, and invited talks on production AI engineering"
          ]
        },
        {
          "company": "Asana",
          "title": "Senior Software Engineer",
          "period": "November 2023 – April 2025",
          "summary": null,
          "details": [
            "Led a 10-month, 3-engineer enterprise permissions initiative (Custom Field Permissions) to GA 1.5 months ahead of schedule, now adopted by 37 of the Top 100 enterprise accounts, by solo-owning the most complex milestone and coordinating across 4+ platform teams.",
            "Served as Project Engineering Lead (PEL) for Permissions in Automations, driving end-to-end delivery through crisp planning, stakeholder communication, and early risk mitigation on a high-urgency, complex feature.",
            "Accelerated team velocity by authoring a timeline planning methodology that eliminated arbitrary buffers, later adopted by other workstreams, and creating robust testing plans leveraged across multiple releases.",
            "Mentored two L3 engineers through structured 1:1s, code reviews, and pairing—directly contributing to one engineer's promotion to L4 through rigorous evaluation and advocacy.",
            "Scaled cross-team collaboration by authoring an engineering partnership rolodex and collaboration guidelines, enabling faster unblocking and reducing dependency friction across the organization."
          ]
        },
        {
          "company": "Terrastruct",
          "title": "Founding Engineer",
          "period": "March 2021 – July 2023",
          "summary": null,
          "details": [
            "Established the engineering foundation as the first hire, shaping technical direction, processes, and culture during the company's earliest growth stage.",
            "Improved product quality and iteration speed by leading development and ongoing maintenance of Terrastruct's custom Diagram IDE (React, Golang) used on app.terrastruct.com.",
            "Expanded the reach of the D2 ecosystem by contributing to the open-source D2 diagramming language (20k+ GitHub stars) and building integrations with Slack, Obsidian, GitHub, Discord, and other platforms.",
            "Enhanced team capabilities and long-term execution by conducting interviews, driving short- and long-range planning, and promoting strong engineering culture and best practices."
          ]
        },
        {
          "company": "AllStripes",
          "title": "Founding Engineer",
          "period": "February 2019 – March 2021",
          "summary": null,
          "details": [
            "Second engineer and fifth full time employee hired.",
            "Full-stack development on AllStripes' proprietary research operations tool.",
            "Maintained a database in PostgreSQL that was managed with Parse, managed deployments in GCS.",
            "Built a new state of the art medical data abstraction tool using React/TypeScript."
          ]
        },
        {
          "company": "TuneIn",
          "title": "Software Engineer",
          "period": "September 2017 – February 2019",
          "summary": null,
          "details": ["Software Engineer on the Ads team, Web team, and Embed Player"]
        },
        {
          "company": "Expedia, Inc.",
          "title": "Software Engineer",
          "period": "August 2016 – September 2017",
          "summary": null,
          "details": ["Software Engineer for the Local Expert and Hotel Search teams"]
        }
      ]
    },
    {
      "id": "education",
      "title": "Education",
      "items": [
        {
          "school": "University of Southern California | Viterbi School of Engineering",
          "degree": "Bachelor of Science (B.S) in Computer Science",
          "period": "August 2012 – May 2016"
        }
      ]
    },
    {
      "id": "travels",
      "title": "Travels"
    },
    {
      "id": "concerts",
      "title": "Concerts"
    }
  ]
}
